// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

// Решение через строку
// System.Console.WriteLine("Введите пятизначное число: ");

// string num = Convert.ToString(Console.ReadLine());

// if(num[0]== num[4] && num[1]==num[3]){
//     System.Console.WriteLine("Да");
// }
// else{
//     System.Console.WriteLine("Нет");
// }



// Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.


// System.Console.WriteLine("Введите координаты первой точки X1: ");
// int x1 = Convert.ToInt32(Console.ReadLine());
// System.Console.WriteLine("Введите координаты первой точки Y1: ");
// int y1 = Convert.ToInt32(Console.ReadLine());
// System.Console.WriteLine("Введите координаты первой точки Z1: ");
// int z1 = Convert.ToInt32(Console.ReadLine());



// System.Console.WriteLine("Введите координаты первой точки X2: ");
// int x2 = Convert.ToInt32(Console.ReadLine());
// System.Console.WriteLine("Введите координаты первой точки Y2: ");
// int y2 = Convert.ToInt32(Console.ReadLine());
// System.Console.WriteLine("Введите координаты первой точки Z2: ");
// int z2 = Convert.ToInt32(Console.ReadLine());

// double result = Math.Sqrt(Math.Pow((x2-x1),2)+Math.Pow((y2-y1),2)+Math.Pow((z2-z1),2));
// System.Console.WriteLine(result);


//Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.

// System.Console.WriteLine("Введите число: ");
// int num = Convert.ToInt32(Console.ReadLine());

// for (int i = 1; i <= num; i++){
//     Console.Write($"{Math.Pow(i,3)} ");
// }


